# GetCalloutParentId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetCalloutParentId Method
View Class See Also
---
Gets ID of the callout parent view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId GetCalloutParentId()
```

Visual Basic
---
```text
Public Function GetCalloutParentId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetCalloutParentId()
```

# ### Return Value
ID of a view in which this callout was created or InvalidElementId if there is no parent.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This view is not a callout. |

# See Also
View Class
Autodesk.Revit.DB Namespace